# SetToolByName

## Description
Similar to SetTool, but takes name rather than ID. Supports plug-in tools (but not yet internal tools).

```pascal
FUNCTION SetToolByName(toolName : STRING): BOOLEAN;
```

```python
def vs.SetToolByName(toolName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|toolName|STRING|   |

## Version
Availability: from Vectorworks 2014

## Category
* Utility